![](intro_image.png)

----------
# Dannys' Diner

Danny wants to use the data to answer a few simple questions about his customers, especially about their visiting patterns, how much money theyâ€™ve spent and also which menu items are their favourite. Having this deeper connection with his customers will help him deliver a better and more personalised experience for his loyal customers.

He plans on using these insights to help him decide whether he should expand the existing customer loyalty program

In this notebook, we are going to analyze data provided by danny, that I have created in my mysql database. The dataset contains information about sales, customers that has become a member and the menu. We are going to find the answers to questions like:

What is the total amount each customer spent at the restaurant?
How many days has each customer visited the restaurant?
What was the first item from the menu purchased by each customer?
What is the most purchased item on the menu and how many times was it purchased by all customers?
Which item was the most popular for each customer?
Which item was purchased first by the customer after they became a member?
Which item was purchased just before the customer became a member?
What is the total items and amount spent for each member before they became a member?
If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?
In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?


The project is found on twitter, [click here to access](https://8weeksqlchallenge.com/case-study-1/)


The first line of code connects us to the dannys_dinner where the table sales, member and menu is residing. while the second line of code is used to SELECT all of the columns from the sales table. Also, we'll limit the output to the first ten rows to keep the output clean.

In [1]:
%load_ext sql
%sql mysql+pymysql://root:Kemmy1997#@localhost:3306/dannys_diner

'Connected: root@dannys_diner'

In [2]:
%%sql
SELECT *
FROM
    dannys_diner.sales
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
10 rows affected.

[('A', datetime.date(2021, 1, 1), 1),
 ('A', datetime.date(2021, 1, 1), 2),
 ('A', datetime.date(2021, 1, 7), 2),
 ('A', datetime.date(2021, 1, 10), 3),
 ('A', datetime.date(2021, 1, 11), 3),
 ('A', datetime.date(2021, 1, 11), 3),
 ('B', datetime.date(2021, 1, 1), 2),
 ('B', datetime.date(2021, 1, 2), 2),
 ('B', datetime.date(2021, 1, 4), 1),
 ('B', datetime.date(2021, 1, 11), 1)]

# Question 1 - What is the total amount each customer spent at the restaurant?

In [6]:
%%sql
SELECT
    customer_id,
    SUM(price) AS Amount_spent
FROM
    sales
INNER JOIN
    menu
ON sales.product_id = menu.product_id
GROUP BY
    customer_id;

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
3 rows affected.

[('A', Decimal('76')), ('B', Decimal('74')), ('C', Decimal('36'))]

From the query above we discovered that the total aount spent by customer A is 76 dollars, Customer B is 74 dollars, and Customer C is \$36

# Question 2 - How many days has each customer visited the restaurant?

In [7]:
%%sql
SELECT
    customer_id,
    COUNT(DISTINCT order_date) AS Days_visited
FROM
    sales
GROUP BY
    customer_id;

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
3 rows affected.

[('A', 4), ('B', 6), ('C', 2)]

# Question 3 - What was the first item from the menu purchased by each customer?

In [8]:
%%sql
SELECT
    customer_id,
    product_name
FROM
    (SELECT
        customer_id, product_id, order_date,
        ROW_NUMBER() OVER(PARTITION BY customer_id ORDER BY order_date ASC) AS rnk
    FROM
        sales) e
JOIN
    menu
ON
    e.product_id = menu.product_id
WHERE e.rnk = 1

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
3 rows affected.

[('A', 'sushi'), ('B', 'curry'), ('C', 'ramen')]

# Question 4 - What is the most purchased item on the menu and how many times was it purchased by all customers?

In [9]:
%%sql

SELECT
    product_name AS most_purchased_product,
    count(e.product_id) AS number_of_times_purchased
FROM
    sales e
JOIN
    menu
ON
    e.product_id = menu.product_id
GROUP BY
    product_name
ORDER BY 
    number_of_times_purchased DESC
LIMIT 1

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
1 rows affected.

[('ramen', 8)]

# Question 5 - Which item was the most popular for each customer?

In [10]:
%%sql

WITH Ranked_Products AS (
    SELECT
        customer_id,
        product_name,
        COUNT(*) AS purchase_count,
        RANK() OVER (PARTITION BY s.customer_id ORDER BY COUNT(*) DESC) lINE 
    FROM
        Sales s
    JOIN
        menu  ON s.product_id = menu.product_id
    GROUP BY
        s.customer_id, menu.product_name
)
SELECT
    customer_id,
    product_name
FROM
    Ranked_Products
WHERE
    lINE = 1;

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
5 rows affected.

[('A', 'ramen'),
 ('B', 'curry'),
 ('B', 'sushi'),
 ('B', 'ramen'),
 ('C', 'ramen')]

From the query above, it was noticed that three three menu sold in danny's diner is popular for Customer B, whereas tyhe popular menu for both Customer A  and Customer C is Ramen

# Question 6 - Which item was purchased first by the customer after they became a member?

In [11]:
%%sql

SELECT
    customer_id,
    product_name
FROM
    (SELECT
        s.customer_id,
        m.product_name,
        s.order_date,
        FIRST_VALUE(s.product_id) OVER(PARTITION BY s.Order_date ORDER BY s.order_date),
        ROW_NUMBER() OVER(PARTITION BY s.customer_id) AS rnum
    FROM sales s
    LEFT JOIN members mb
    ON s.customer_id = mb.customer_id
    LEFT JOIN
        menu m
    ON s.product_id = m.product_id
    WHERE mb.join_date < s.order_date) e

WHERE rnum = 1;

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
2 rows affected.

[('A', 'ramen'), ('B', 'sushi')]

We nticed in the output above that customer C is not included, that is because Customer C has not become a member yet, 
he is still trying out the menu I thinkðŸ˜Š

# Question 7 - Which item was purchased just before the customer became a member?

In [36]:
%%sql

SELECT
    customer_id,
    product_name
FROM
        (SELECT
        s.customer_id,
        m.product_name,
        s.order_date,
        Rank() OVER(PARTITION BY s.customer_id ORDER BY order_date DESC) AS rnum
    FROM sales s
    LEFT JOIN members mb
    ON s.customer_id = mb.customer_id
    JOIN
        menu m
    ON s.product_id = m.product_id
    WHERE mb.join_date > s.order_date) e

WHERE e.rnum = 1

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
3 rows affected.

[('A', 'sushi'), ('A', 'curry'), ('B', 'sushi')]

Customer a became a member in 2021-01-07, and the two menu he purchased( which was also his last) before becoming a member was sushi and curry which was the same day 2021-01-01, whuile Customer B became a member in 2021-01-09 and the last product he purchased before becoming a mmber was Shushi 2021-01-04

# Question 8 - What is the total items and amount spent for each member before they became a member?

In [37]:
%%sql

SELECT
    s.customer_id,
    COUNT(s.product_id) AS total_item,
    SUM(price) AS total_amount
FROM
    sales s
JOIN
    menu m

ON 
    s.product_id = m.product_id
LEFT JOIN
    members mb
ON
    s.customer_id = mb.customer_id

WHERE
    join_date > order_date
GROUP BY
    customer_id

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
2 rows affected.

[('A', 2, Decimal('25')), ('B', 3, Decimal('40'))]

# Question 9 - If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?

In [31]:
%%sql

WITH PNT AS(
        SELECT
            customer_id,
            CASE
                WHEN m.product_name = "sushi"
                THEN
                    20 * SUM(price) 
                ELSE
                    10 * SUM(price)

            END AS points
        FROM
            sales s
        JOIN
            menu m

        ON 
            s.product_id = m.product_id
        GROUP BY
            m.product_name,customer_id)
SELECT
    customer_id,
    SUM(points) AS Total_Points
FROM
    PNT
GROUP BY
    customer_id;

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
3 rows affected.

[('A', Decimal('860')), ('B', Decimal('940')), ('C', Decimal('360'))]

# Question 10 - In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?

In [55]:
%%sql
SELECT
    customer_id,
    SUM(points) AS Total_points
FROM
    (SELECT
        s.customer_id,
        order_date,
        CASE
            WHEN
                (order_date >= join_date) AND (s.order_date <= DATE_ADD(mb.join_date, INTERVAL 7 DAY))
            THEN
                20 * price
            ELSE
                10 * price
        END AS points
            FROM
                sales s
            JOIN
                menu m

            ON
                s.product_id = m.product_id
            JOIN
                members mb
            ON
                mb.customer_id = s.customer_id) K
WHERE
    EXTRACT(MONTH FROM order_date) = 1
GROUP BY
    customer_id;

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
2 rows affected.

[('A', Decimal('1270')), ('B', Decimal('840'))]

# Bonus Question
# he following questions are related creating basic data tables that Danny and his team can use to quickly derive insights without needing to join the underlying tables using SQL.Recreate the following table output using the available data:

In [68]:
%%sql
SELECT
    s.customer_id,
    order_date,
    product_name,
    price,
    CASE
        WHEN order_date >= join_date
        THEN
              "Y"
        ELSE
              "N"
    END AS member       
FROM
    sales s
JOIN
    menu m
ON
    s.product_id = m.product_id
LEFT JOIN
    members mb
ON
    mb.customer_id = s.customer_id

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
15 rows affected.

[('A', datetime.date(2021, 1, 1), 'sushi', 10, 'N'),
 ('A', datetime.date(2021, 1, 1), 'curry', 15, 'N'),
 ('A', datetime.date(2021, 1, 7), 'curry', 15, 'Y'),
 ('A', datetime.date(2021, 1, 10), 'ramen', 12, 'Y'),
 ('A', datetime.date(2021, 1, 11), 'ramen', 12, 'Y'),
 ('A', datetime.date(2021, 1, 11), 'ramen', 12, 'Y'),
 ('B', datetime.date(2021, 1, 1), 'curry', 15, 'N'),
 ('B', datetime.date(2021, 1, 2), 'curry', 15, 'N'),
 ('B', datetime.date(2021, 1, 4), 'sushi', 10, 'N'),
 ('B', datetime.date(2021, 1, 11), 'sushi', 10, 'Y'),
 ('B', datetime.date(2021, 1, 16), 'ramen', 12, 'Y'),
 ('B', datetime.date(2021, 2, 1), 'ramen', 12, 'Y'),
 ('C', datetime.date(2021, 1, 1), 'ramen', 12, 'N'),
 ('C', datetime.date(2021, 1, 1), 'ramen', 12, 'N'),
 ('C', datetime.date(2021, 1, 7), 'ramen', 12, 'N')]

# Danny also requires further information about the ranking of customer products, but he purposely does not need the ranking for non-member purchases so he expects null ranking values for the records when customers are not yet part of the loyalty program.

In [74]:
%%sql
WITH membership AS (
        SELECT
            s.customer_id,
            order_date,
            product_name,
            price,
            CASE
                WHEN order_date >= join_date
                THEN
                      "Y"
                ELSE
                      "N"
            END AS member

        FROM
            sales s
        JOIN
            menu m
        ON
            s.product_id = m.product_id
        LEFT JOIN
            members mb
        ON
            mb.customer_id = s.customer_id)
SELECT
    customer_id,
    order_date,
    product_name,
    price,member,
    CASE
        WHEN
            member = "Y"
        THEN
            RANK() OVER(PARTITION BY s.customer_id,member ORDER BY order_date)
        ELSE
            'null' 
    END AS ranking
FROM
    membership;

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
15 rows affected.

[('A', datetime.date(2021, 1, 1), 'sushi', 10, 'N', 'null'),
 ('A', datetime.date(2021, 1, 1), 'curry', 15, 'N', 'null'),
 ('A', datetime.date(2021, 1, 7), 'curry', 15, 'Y', '1'),
 ('A', datetime.date(2021, 1, 10), 'ramen', 12, 'Y', '2'),
 ('A', datetime.date(2021, 1, 11), 'ramen', 12, 'Y', '3'),
 ('A', datetime.date(2021, 1, 11), 'ramen', 12, 'Y', '3'),
 ('B', datetime.date(2021, 1, 1), 'curry', 15, 'N', 'null'),
 ('B', datetime.date(2021, 1, 2), 'curry', 15, 'N', 'null'),
 ('B', datetime.date(2021, 1, 4), 'sushi', 10, 'N', 'null'),
 ('B', datetime.date(2021, 1, 11), 'sushi', 10, 'Y', '1'),
 ('B', datetime.date(2021, 1, 16), 'ramen', 12, 'Y', '2'),
 ('B', datetime.date(2021, 2, 1), 'ramen', 12, 'Y', '3'),
 ('C', datetime.date(2021, 1, 1), 'ramen', 12, 'N', 'null'),
 ('C', datetime.date(2021, 1, 1), 'ramen', 12, 'N', 'null'),
 ('C', datetime.date(2021, 1, 7), 'ramen', 12, 'N', 'null')]